/*!
 **  \file   codeLib.c
 **  \brief  Библиотека кодирования/декодирования для РТМ и МКИО.
 */

/*  Включаемые файлы
 ********************************************************************************
 */
#include "codelib.h"

/*  Макросы и константы
 ********************************************************************************
 */

/*  Типы данных
 ********************************************************************************
 */

/*  Глобальные, локальные данные
 ********************************************************************************
 */
/*  Описание и определение функций
 ********************************************************************************
 */
TUInt8 byte_revers(
        TUInt8 byte
        )
{
    return (((byte & 0x80) >> 7) | ((byte & 0x40) >> 5) |
            ((byte & 0x20) >> 3) | ((byte & 0x10) >> 1) |
            ((byte & 0x08) << 1) | ((byte & 0x04) << 3) |
            ((byte & 0x02) << 5) | ((byte & 0x01) << 7));
}